DataProcessors/омг_ПанельАдминистрированияИнтеграций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_ПанельАдминистрированияИнтеграций</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/омг_НастройкиИнтеграцииСЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_НастройкиИнтеграцииСЛИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециализацияПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоИзмененияНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоИзмененияДопПолейНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоИзмененияЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоИзмененияНаборов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоИзмененияБиоматериаловИКонтейнеров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогинFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПортFTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗащищенноеСоединениеFTP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьККаталогуFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжиданияСоединения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьДополнительнуюПриостановкуИсследований</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжиданияСоединенияСозданиеНаправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновлениеАнализов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновлениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбновлениеБиоматериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/омг_КлючиОбновленийСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_КлючиОбновленийСправочников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеАнализовЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеЦенЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеАрхивированных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеБиоматериаловЛИС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/омг_ПанельАдминистрированияИнтеграций/Forms/НастройкиИнтеграцииСЛИС/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка);

		ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСЛИС", "Пароль");

		Пароль = ?(ДанныеПароля = Неопределено, "", Новый УникальныйИдентификатор);
		
		ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСЛИС", "ПарольFTP");

		ПарольFTP = ?(ДанныеПароля = Неопределено, "", Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Поля = Метаданные.РегистрыСведений.омг_НастройкиИнтеграцииСЛИС.Ресурсы;
	СтруктураНастроек = Новый Структура;
	Для Каждого Поле Из Поля Цикл
		СтруктураНастроек.Вставить(Поле.Имя, ЗаписьРегистра[Поле.Имя]);
	КонецЦикла;
	
	Запись = РегистрыСведений.омг_НастройкиИнтеграцииСЛИС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ЗаписьРегистра);
	Запись.Записать();
	
	Если ПарольИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ИнтеграцияСЛИС", Новый ХранилищеЗначения(Пароль), "Пароль");
		УстановитьПривилегированныйРежим(Ложь);
		
		Пароль = Новый УникальныйИдентификатор;
		ПарольИзменен = Ложь;
		
	КонецЕсли;
	Если ПарольFTPИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ИнтеграцияСЛИС", Новый ХранилищеЗначения(ПарольFTP), "ПарольFTP");
		УстановитьПривилегированныйРежим(Ложь);
		
		ПарольFTP = Новый УникальныйИдентификатор;
		ПарольFTPИзменен = Ложь;
		
	КонецЕсли;
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.омг_СинхронизацияДанныхСЛИС);
	РеглЗадание.Параметры.Очистить();
	
	Ключи = Новый Массив;
	
	Если Запись.ОбновлениеАнализов Тогда
		Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеАнализовЛИС);
	КонецЕсли;
	Если Запись.ОбновлениеЦен Тогда
		Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеЦенЛИС);
	КонецЕсли;
	Если Запись.ОбновлениеБиоматериалов Тогда
		Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеБиоматериаловЛИС);
	КонецЕсли;
	
	РеглЗадание.Параметры.Добавить(Ключи);
	РеглЗадание.Использование = ?(Ключи.Количество() > 0, Истина, Ложь);
	РеглЗадание.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПарольFTPПриИзменении(Элемент)
	
	ПарольFTPИзменен = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасписание()
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.омг_СинхронизацияДанныхСЛИС);
	Возврат РеглЗадание.Расписание;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьРасписание(Расписание)
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.омг_СинхронизацияДанныхСЛИС);
	РеглЗадание.Расписание = Расписание;
	РеглЗадание.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеИзмененияРасписания(Расписание, ДопПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьРасписание(Расписание);
	
КонецПроцедуры

&НаКлиенте
Процедура Расписание(Команда)
	
	Расписание = ПолучитьРасписание();
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеИзмененияРасписания", ЭтаФорма);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры
